import { IPatchNotes } from '.';

export const notes: IPatchNotes = {
  version: '1.1.20230711-1',
  title: '1.1.20230711-1',
  notes: [
    "OBS Studioを25から28系に更新することにより、以下の機能を追加 (#657, #672, #673)。",
    "* 追加:アプリケーション音声キャプチャ(β版)",
    "* 改善:WebページソースのChromiumバージョン更新, CSS改善",
    "* 追加:ソースのブレンドモードを追加",
    "追加:Webページソースにインタラクション(操作)を追加 (#657)",
    "修正:Webページソースを音声ソースに追加するかどうかの設定を追加 (#657)",
    "修正:画像スライドソースの歯車アイコンが機能していなかったのを修正 (#657, #666, #667)",
    "修正:ニコ生の番組作成と番組編集ウィンドウから英語のメニューバーを削除 (#669)",
  ]
};
